SHG4666/STM32PROJECT/STM32_Project/1-9 TIM输出比较(舵机的代码)/Hardware/TIMInterrupt.c
#include "stm32f10x.h"                  // Device header
extern uint16_t num; 
void TIM_Init()
{
//    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
//    GPIO_InitTypeDef  GPIO_InitStructure;
//    GPIO_InitStructure.GPIO_Mode =GPIO_Mode_IPU;
//    GPIO_InitStructure.GPIO_Pin =GPIO_Pin_2;
//    GPIO_InitStructure.GPIO_Speed =GPIO_Speed_50MHz;
//    GPIO_Init(GPIOD, &GPIO_InitStructure);
    
//    TIM_ETRClockMode2Config(TIM3, TIM_ExtTRGPSC_OFF, TIM_ExtTRGPolarity_NonInverted,0x00);
    TIM_InternalClockConfig(TIM3);
    
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode =TIM_CounterMode_Up;
    TIM_TimeBaseInitStructure.TIM_Period =10000-1;
    TIM_TimeBaseInitStructure.TIM_Prescaler =7200-1;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter =0;
    TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStructure);
    
    TIM_ClearFlag(TIM3,TIM_FLAG_Update);//防止一开始就进中断
    TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);
    
    
    
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    
    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel =TIM3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd =ENABLE;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority =2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority =1;
    NVIC_Init(&NVIC_InitStructure);
    
    TIM_Cmd(TIM3, ENABLE);
}

uint16_t TIM_GetTimNum()
{
    return TIM_GetCounter(TIM3);
}